#include "console.h"
#include <vector>
using namespace std;


/*######################## DATA ###########################*/
// const values
static const char* HERO_NAME[] = {"Hammerguard", "Master", "Berserker", "Scouter"};

// map info

// constructor units info

// neutral monsters info

// enemy heroes info



/*################# Assistant functions ####################*/





/*##################### STATEMENT ##########################*/
/************************************************************
 * Observer
 ************************************************************/
// 汇总所有发现的信息,便于各级指挥官决策



/************************************************************
 * Global commander
 ************************************************************/
// 全局指挥官,分析形势,编队,给小队下达指令.
// 注意小队的状态,处在执行任务的小队,除非被强行终止,否则无法接受全局指挥官指令


/************************************************************
 * Team leader
 ************************************************************/
// 小队长,其实是虚构决策器.结合环境信息,全局指挥官指令,下达采矿/攻击/寻路/逃跑/待命等指令,下达到每一个单位


/************************************************************
 * Hero
 ************************************************************/
// 各自为战的英雄,除非遇到危机情况,皆听从小队长指令.技能选择由英雄各自选择,可以考虑继承关系,对不同英雄实现不同决策.
// 设想:英雄处于听命/逃命/采矿/警戒/攻击/中招等状态,在已有决策基础上,添加个性决策


/*#################### MAIN FUNCTION #######################*/
void player_ai(const PMap &map, const PPlayerInfo &info, PCommand cmd) {

}



/*################### IMPLEMENTATION #######################*/
/************************************************************
 * Implementation: struct Observer
 ************************************************************/


/************************************************************
 * Implementation: struct Commander
 ************************************************************/


/************************************************************
 * Implementation: struct TeamLeader
 ************************************************************/


/************************************************************
 * Implementation: struct Commander
 ************************************************************/